dist = {
"а" : "ч",
"б" : "я",
"в" : "ю",
"г" : "э",
"д" : "ы",
"е" : "ь",
"ж" : "щ",
"з" : "ш",
"и" : "ц",
"к" : "х",
"л" : "ф",
"м" : "у",
"н" : "б",
"о" : "д",
"п" : "т",
"р" : "з",
"с" : "в",
"т" : "р",
"у" : "п",
"ф" : "м",
"х" : "л",
"ц" : "к",
"ч" : "а",
"ш" : "и",
"щ" : "о",
"ь" : "ж",
"ы" : "е",
"э" : "с",
"ю" : "г",
"я" : "н"
}

a= []
st = "книга"
#while not(dist[st[0]]+dist[st[1]]+dist[st[2]]+dist[st[3]]+dist[st[4]] in a):
for i in range(400):
    a.append(dist[st[0]]+dist[st[1]]+dist[st[2]]+dist[st[3]]+dist[st[4]])
    st = dist[st[0]]+dist[st[1]]+dist[st[2]]+dist[st[3]]+dist[st[4]]
print(len(a))
for i in range(400):
    print(i, a[i])
